[{"title": "A State Transition Diagram for Disease", "description": "This model illustrates the use of state transition diagrams to model a simple disease. This is a disease such as the flu where immunity is obtained once the individual recovers from the disease."},{"cmd": "Math.seedrandom(1)"},{"geometry":{"x":470,"y":120,"width":100,"height":40},"name":"Healthy","create":"State"},{"geometry":{"x":470,"y":240,"width":100,"height":40},"name":"Infected","create":"State"},{"geometry":{"x":470,"y":360,"width":100,"height":40},"name":"Recovered","create":"State"},"DIAGRAM","States represent the condition someone is in. So in our model a person can either be healthy, infected, or recovered from the infection. Now, let's add transitions that move a person from state to state.",{"geometry":{"x":0,"y":0,"width":100,"height":100},"alpha":"Healthy","omega":"Infected","name":"Infection","create":"Transition"},{"geometry":{"x":0,"y":0,"width":100,"height":100},"alpha":"Infected","omega":"Recovered","name":"Recovery","create":"Transition"},"Please note that in this model someone who is recovered cannot become sick again. They have gained immunity to the disease. ","Now that the model structure has been designed, let's add equations and configure the primitives.",{"attribute":"Active","target":"Healthy","value":"True"},"DIAGRAM","When a state is active, it means a person is in that state. By setting [Healthy] to start active, we have the person start in the healthy state.",{"attribute":"Trigger","target":"Infection","value":"Probability"},{"attribute":"Value","target":"Infection","value":"0.3"},{"attribute":"Trigger","target":"Recovery","value":"Probability"},{"attribute":"Value","target":"Recovery","value":"0.2"},"Using the Probability type for the transition trigger means that the person has a fixed probability of transitioning from one state to the next each year. We will assume a 30% probability of the person becoming sick each year and once sick, a 20% chance of recovering each year.","Let's run the model now.","RESULTS","A value of 1 for a state primitive means it is active. A value of 0 means it is not active. We can see from this diagram when the individual transitions from the healthy to the infected state and then from the infected state to recovered state.","We can run the model again and we will see that we get different results each time we run it. This is because the model is stochastic and the transition triggers are random.","RESULTS"]